import Layout from "../components/Layout/Layout";
import PhotoCard from "../components/PhotoCard/PhotoCard";

const SpeciesPage = () => {
  return (
    <>
      <Layout
        titleText="Види нерозлучників"
        subtitleText="Познайомимось з усіма цими пернатими красенями"
        backgroundVariant={3}
      >
        <div className="species-page">
          <PhotoCard />
          <PhotoCard
            title="Нерозлучник рожевощокий"
            text="У його оперенні присутні безліч різних кольорів. Основний із них — трав'янисто-зелений. Короткий гострий хвіст і низ спини рясніють блакитним і синім. Передня частина голови персикового кольору, горло і шия трохи світліші. Невеликий дзьоб забарвлений у світлий колір."
            bgVar={2}
          />
          <PhotoCard
            title="Нерозлучник масковий"
            text="Нерозлучник із чорною маскою або нерозлучник із кільцем у очах, — монотипний вид птахів із роду Нерозлучник родини папугових Psittaculidae. Вони походять з регіону Аруша в Танзанії і були завезені в Бурунді та Кенію."
            bgVar={3}
          />
          <PhotoCard
            title="Нерозлучник фішера"
            text="Один з найменших видів нерозлучника. Довжина тіла разом з пір’ям хвоста рідко перевищує — 15 см. Вага дорослого птаха коливається в межах — 45-60 грам. Розмах крил становить близько — 20 см."
            bgVar={4}
          />
          <PhotoCard
            title="Нерозлучник ліберійський"
            text="Невеликий африканський папуга довжиною 13,5 см (5 дюймів) з роду Agapornis. Це переважно зелений папуга з чорною смугою на шиї та темним сірувато-чорним дзьобом. Обидві статі схожі. Його рідко тримають у неволі через його харчові потреби для місцевого інжиру."
            bgVar={6}
          />
          <PhotoCard
            title="Нерозлучник червоноголовий"
            text="Він переважно зелений і має помаранчевий колір на верхній частині грудей і голові. Він має довжину 13 см (5 дюймів) і є найменшим папугою на материковій частині Африки. У неволі це нечасто і важко розводити."
            bgVar={5}
          />
          <PhotoCard
            title="Нерозлучник чорнокрилий"
            text="Птах завдовжки до 16 см, вагою 49-66 г. Основне оперення зелене, у самців яскравіше, у самиць тьмяніше. Кінчики крил та хвоста чорні. У самців лоб та навколоочне кільце червоне. В обох статей червоний дзьоб і сірі ноги."
            bgVar={7}
          />
          <PhotoCard
            title="Нерозлучник червоноголовий"
            text="Папуга довжиною 15 см переважно зеленого кольору. На голові має червону ділянку, що тягнеться від верхівки дзьоба, над лобом до середини тім’я та тягнеться ліворуч і праворуч до країв повік. Має сірі ноги. Самка має помаранчеве забарвлення голови, яка гірше відмежована, ніж червона голова самця."
            bgVar={8}
          />
          <PhotoCard
            title="Нерозлучник сизий"
            text="Сизий нерозлучник найдрібніший з нерозлучників. Єдиний вид нерозлучника, що живе на о. Мадагаскар."
            bgVar={9}
          />
        </div>
      </Layout>
    </>
  );
};

export default SpeciesPage;
